---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.TextureOffsetLock
source: html/551c8ecb-095f-0264-540d-16224b5060af.htm
---
# Autodesk.Revit.DB.Visual.Gradient.TextureOffsetLock Property

The property labeled "Offset Lock" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string TextureOffsetLock { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".